; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite5 - satellite
	instrument9 - instrument
	satellite6 - satellite
	instrument10 - instrument
	satellite7 - satellite
	instrument11 - instrument
	instrument12 - instrument
	spectrograph1 - mode
	thermograph0 - mode
	Star8 - direction
	GroundStation7 - direction
	GroundStation4 - direction
	Star6 - direction
	Star1 - direction
	Star5 - direction
	Star0 - direction
	Star2 - direction
	Star3 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument1 thermograph0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 Star0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation7)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 Star1)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star3)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star8)
	(supports instrument4 spectrograph1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 Star1)
	(supports instrument5 spectrograph1)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 Star0)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 Star6)
	(calibration_target instrument6 Star0)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star5)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 GroundStation4)
	(calibration_target instrument7 Star6)
	(supports instrument8 thermograph0)
	(supports instrument8 spectrograph1)
	(calibration_target instrument8 Star2)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star0)
	(supports instrument9 spectrograph1)
	(calibration_target instrument9 Star5)
	(calibration_target instrument9 Star1)
	(calibration_target instrument9 Star6)
	(on_board instrument9 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Phenomenon10)
	(supports instrument10 spectrograph1)
	(supports instrument10 thermograph0)
	(calibration_target instrument10 Star0)
	(calibration_target instrument10 Star5)
	(on_board instrument10 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star0)
	(supports instrument11 thermograph0)
	(supports instrument11 spectrograph1)
	(calibration_target instrument11 Star2)
	(calibration_target instrument11 Star0)
	(calibration_target instrument11 Star3)
	(supports instrument12 thermograph0)
	(supports instrument12 spectrograph1)
	(calibration_target instrument12 Star3)
	(calibration_target instrument12 Star2)
	(on_board instrument11 satellite7)
	(on_board instrument12 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Planet9)
)
(:goal (and
	(pointing satellite3 Star2)
	(pointing satellite4 Star8)
	(have_image Planet9 thermograph0)
	(have_image Phenomenon10 spectrograph1)
	(have_image Star11 spectrograph1)
	(have_image Phenomenon12 thermograph0)
	(have_image Phenomenon13 thermograph0)
))

)

; plan
1. (switch_on instrument10 satellite6)
   deleted: (power_avail satellite6)
   added: (power_on instrument10)
   goals met: 0 of 7
2. (calibrate satellite6 instrument10 star0)
   added: (calibrated instrument10)
   goals met: 0 of 7
3. (turn_to satellite6 phenomenon13 star0)
   deleted: (pointing satellite6 star0)
   added: (pointing satellite6 phenomenon13)
   goals met: 0 of 7
4. (take_image satellite6 phenomenon13 instrument10 thermograph0)
   added: (have_image phenomenon13 thermograph0)
   goals met: 1 of 7
5. (turn_to satellite6 phenomenon12 phenomenon13)
   deleted: (pointing satellite6 phenomenon13)
   added: (pointing satellite6 phenomenon12)
   goals met: 1 of 7
6. (take_image satellite6 phenomenon12 instrument10 thermograph0)
   added: (have_image phenomenon12 thermograph0)
   goals met: 2 of 7
7. (turn_to satellite6 phenomenon10 phenomenon12)
   deleted: (pointing satellite6 phenomenon12)
   added: (pointing satellite6 phenomenon10)
   goals met: 2 of 7
8. (turn_to satellite4 star8 star0)
   deleted: (pointing satellite4 star0)
   added: (pointing satellite4 star8)
   goals met: 3 of 7
9. (turn_to satellite3 star2 star5)
   deleted: (pointing satellite3 star5)
   added: (pointing satellite3 star2)
   goals met: 4 of 7
10. (take_image satellite6 phenomenon10 instrument10 spectrograph1)
   added: (have_image phenomenon10 spectrograph1)
   goals met: 5 of 7
11. (turn_to satellite6 planet9 phenomenon10)
   deleted: (pointing satellite6 phenomenon10)
   added: (pointing satellite6 planet9)
   goals met: 5 of 7
12. (take_image satellite6 planet9 instrument10 thermograph0)
   added: (have_image planet9 thermograph0)
   goals met: 6 of 7
13. (turn_to satellite6 star11 planet9)
   deleted: (pointing satellite6 planet9)
   added: (pointing satellite6 star11)
   goals met: 6 of 7
14. (take_image satellite6 star11 instrument10 spectrograph1)
   added: (have_image star11 spectrograph1)
   goals met: 7 of 7
